#+STARTUP: INDENT LOGDONE OVERVIEW NOLOGREFILE LATEXPREVIEW INLINEIMAGES
#+AUTHOR: kirakuiin
#+EMAIL: wang.zhuowei@foxmail.com
#+LANGUAGE: zh-Cn
#+TAGS: { Work : learn(l) work(w) }
#+TAGS: { State : future(f) }
#+TODO: TODO(t) SCH(s) WAIT(w@) | DONE(d!) CANCELED(c@)
#+COLUMNS: %25ITEM %TODO %17Effort(Estimated Effort){:} %CLOCKSUM
#+PROPERTY: EffORT_all 0 0:15 0:30 1:00 2:00 4:00 8:00
#+PROPERTY: ATTACH
#+CATEGORY: work
#+OPTIONS: tex:t

* Inbox
* Next Action
** TODO [#A] 完成每日日报                                             :work:
SCHEDULED: <2021-06-01 周二 19:00 ++1d> DEADLINE: <2021-05-31 周一 23:59 ++1d>
:PROPERTIES:
:STYLE:    habit
:LAST_REPEAT: [2021-05-31 周一 21:38]
:END:

- State "DONE"       from "TODO"       [2021-05-31 周一 21:38]
- State "CANCELED"   from "TODO"       [2021-05-30 Sun 09:17] \\
  放假
- State "DONE"       from "TODO"       [2021-05-29 周六 17:24]
- State "DONE"       from "TODO"       [2021-05-28 周五 23:48]
- State "DONE"       from "TODO"       [2021-05-27 周四 23:32]
- State "DONE"       from "TODO"       [2021-05-26 周三 23:20]
- State "DONE"       from "TODO"       [2021-05-25 周二 23:24]
- State "DONE"       from "TODO"       [2021-05-24 周一 21:20]
- State "DONE"       from "TODO"       [2021-05-23 周日 21:39]
- State "CANCELED"   from "TODO"       [2021-05-22 Sat 11:41] \\
  放假
- State "DONE"       from "TODO"       [2021-05-21 周五 16:46]
- State "DONE"       from "TODO"       [2021-05-20 周四 21:29]
- State "CANCELED"   from "TODO"       [2021-05-19 Wed 08:28] \\
  调休
- State "DONE"       from "TODO"       [2021-05-18 周二 23:12]
- State "DONE"       from "TODO"       [2021-05-17 周一 22:06]
- State "CANCELED"   from "TODO"       [2021-05-16 周日 13:30] \\
  放假
- State "DONE"       from "TODO"       [2021-05-15 周六 21:33]
- State "DONE"       from "TODO"       [2021-05-14 周五 23:32]
- State "DONE"       from "TODO"       [2021-05-13 周四 23:25]
- State "DONE"       from "TODO"       [2021-05-12 周三 21:21]
- State "DONE"       from "TODO"       [2021-05-11 周二 21:16]
- State "DONE"       from "TODO"       [2021-05-10 周一 20:16]
- State "CANCELED"   from "TODO"       [2021-05-09 周日 10:05] \\
  放假
- State "DONE"       from "TODO"       [2021-05-08 周六 23:53]
- State "DONE"       from "TODO"       [2021-05-07 周五 23:20]
- State "DONE"       from "TODO"       [2021-05-06 周四 22:59]
- State "CANCELED"   from "TODO"       [2021-05-05 Wed 21:04] \\
  51假期
- State "CANCELED"   from "TODO"       [2021-05-04 Tue 22:55] \\
  51假期
- State "CANCELED"   from "TODO"       [2021-05-03 Mon 19:02] \\
  51假期
- State "CANCELED"   from "TODO"       [2021-05-02 Sun 20:15] \\
  51假期
- State "CANCELED"   from "TODO"       [2021-05-01 Sat 23:02] \\
  51假期
  
- State "DONE"       from "TODO"       [2021-04-29 周四 21:59]
- State "DONE"       from "TODO"       [2021-04-28 周三 23:04]
- State "DONE"       from "TODO"       [2021-04-27 周二 21:45]
- State "DONE"       from "TODO"       [2021-04-26 周一 23:07]
- State "DONE"       from "TODO"       [2021-04-25 周日 21:56]
- State "CANCELED"   from "TODO"       [2021-04-24 周六 10:35] \\
  放假
- State "DONE"       from "TODO"       [2021-04-23 周五 23:14]
- State "DONE"       from "TODO"       [2021-04-22 周四 23:07]
- State "DONE"       from "TODO"       [2021-04-21 周三 22:20]
- State "DONE"       from "TODO"       [2021-04-20 周二 20:57]
- State "DONE"       from "TODO"       [2021-04-19 周一 22:01]
- State "CANCELED"   from "TODO"       [2021-04-17 周六 23:47] \\
  放假
- State "DONE"       from "TODO"       [2021-04-17 周六 18:50]
- State "DONE"       from "TODO"       [2021-04-16 周五 21:55]
- State "DONE"       from "TODO"       [2021-04-15 周四 22:01]
- State "DONE"       from "TODO"       [2021-04-14 周三 23:01]
- State "DONE"       from "TODO"       [2021-04-13 周二 22:52]
- State "DONE"       from "TODO"       [2021-04-12 周一 21:26]
- State "CANCELED"   from "TODO"       [2021-04-11 周日 18:53] \\
  放假
- State "DONE"       from "TODO"       [2021-04-10 周六 22:17]
- State "DONE"       from "TODO"       [2021-04-09 周五 21:46]
- State "DONE"       from "TODO"       [2021-04-08 周四 21:33]
- State "DONE"       from "TODO"       [2021-04-07 周三 21:45]
- State "DONE"       from "TODO"       [2021-04-06 周二 20:47]
- State "CANCELED"   from "TODO"       [2021-04-05 Sat 9:00]
- State "CANCELED"   from "TODO"       [2021-04-04 Sat 9:00]
- State "CANCELED"   from "TODO"       [2021-04-03 Sat 9:00]
- State "DONE"       from "TODO"       [2021-04-02 周五 22:03]
- State "DONE"       from "TODO"       [2021-04-01 周四 20:50]
- State "DONE"       from "TODO"       [2021-03-31 周三 20:50]
- State "DONE"       from "TODO"       [2021-03-30 周二 21:06]
- State "DONE"       from "TODO"       [2021-03-29 周一 21:11]
** TODO [#A] 完成每周周报                                            :work:
SCHEDULED: <2021-06-05 周六 18:00 ++1w> DEADLINE: <2021-06-07 周一 12:00 ++1w>
:PROPERTIES:
:STYLE:    habit
:LAST_REPEAT: [2021-05-29 周六 18:22]
:END:
- State "DONE"       from "TODO"       [2021-05-29 周六 18:22]
- State "DONE"       from "TODO"       [2021-05-24 周一 11:00]
- State "DONE"       from "TODO"       [2021-05-16 周日 23:48]
- State "DONE"       from "TODO"       [2021-05-09 周日 23:58]
- State "DONE"       from "TODO"       [2021-05-03 周一 22:50]
- State "DONE"       from "TODO"       [2021-04-25 周日 21:56]
- State "DONE"       from "TODO"       [2021-04-17 周六 23:29]
- State "DONE"       from "TODO"       [2021-04-12 周一 10:47]
- State "DONE"       from "TODO"       [2021-04-06 周二 09:23]
- State "DONE"       from "TODO"       [2021-03-29 周一 9:50]
** TODO [#C] 完成leetcode一两道题                                    :learn:
SCHEDULED: <2021-06-01 周二 19:00 ++1d>
:PROPERTIES:
:EFFORT: 0:15
:LINK: [[https://leetcode-cn.com][leetcode]]
:STYLE:    habit
:LAST_REPEAT: [2021-05-31 周一 21:39]
:END:
- State "DONE"       from "TODO"       [2021-05-31 周一 21:39]
- State "DONE"       from "TODO"       [2021-05-30 Sun 10:08]
- State "DONE"       from "TODO"       [2021-05-29 周六 19:17]
- State "DONE"       from "TODO"       [2021-05-28 周五 10:53]
- State "DONE"       from "TODO"       [2021-05-25 周二 09:51]
- State "DONE"       from "TODO"       [2021-05-24 周一 19:35]
- State "DONE"       from "TODO"       [2021-05-22 Sat 12:39]
- State "DONE"       from "TODO"       [2021-05-21 周五 08:54]
- State "DONE"       from "TODO"       [2021-05-20 周四 09:15]
- State "DONE"       from "TODO"       [2021-05-19 Wed 08:44]
- State "DONE"       from "TODO"       [2021-05-18 Tue 23:08]
- State "DONE"       from "TODO"       [2021-05-17 周一 09:08]
- State "DONE"       from "TODO"       [2021-05-16 周日 13:30]
- State "DONE"       from "TODO"       [2021-05-15 周六 23:44]
- State "DONE"       from "TODO"       [2021-05-14 周五 09:54]
- State "DONE"       from "TODO"       [2021-05-13 周四 09:00]
- State "DONE"       from "TODO"       [2021-05-12 周三 09:18]
- State "DONE"       from "TODO"       [2021-05-11 周二 08:55]
- State "DONE"       from "TODO"       [2021-05-10 周一 09:00]
- State "DONE"       from "TODO"       [2021-05-09 周日 10:05]
- State "DONE"       from "TODO"       [2021-05-08 周六 09:30]
- State "DONE"       from "TODO"       [2021-05-07 周五 09:18]
- State "DONE"       from "TODO"       [2021-05-06 周四 23:04]
- State "DONE"       from "TODO"       [2021-05-05 周三 09:12]
- State "DONE"       from "TODO"       [2021-05-04 周二 09:20]
- State "DONE"       from "TODO"       [2021-05-03 周一 13:57]
- State "DONE"       from "TODO"       [2021-05-02 Sun 23:06]
- State "DONE"       from "TODO"       [2021-05-01 Sat 23:14]
- State "DONE"       from "TODO"       [2021-04-29 周四 09:10]
- State "DONE"       from "TODO"       [2021-04-28 周三 08:40]
- State "DONE"       from "TODO"       [2021-04-27 周二 23:44]
- State "DONE"       from "TODO"       [2021-04-26 周一 23:07]
- State "DONE"       from "TODO"       [2021-04-24 周六 21:44]
- State "DONE"       from "TODO"       [2021-04-24 周六 10:42]
- State "DONE"       from "TODO"       [2021-04-22 周四 22:14]
- State "DONE"       from "TODO"       [2021-04-21 周三 22:24]
- State "DONE"       from "TODO"       [2021-04-20 周二 22:07]
- State "DONE"       from "TODO"       [2021-04-20 周二 08:57]
- State "DONE"       from "TODO"       [2021-04-18 周日 18:42]
- State "DONE"       from "TODO"       [2021-04-18 周日 18:30]
- State "DONE"       from "TODO"       [2021-04-17 Sat 09:47]
- State "DONE"       from "TODO"       [2021-04-16 周五 09:50]
- State "DONE"       from "TODO"       [2021-04-15 周四 09:30]
- State "DONE"       from "TODO"       [2021-04-14 周三 09:23]
- State "DONE"       from "TODO"       [2021-04-13 周二 08:56]
- State "DONE"       from "TODO"       [2021-04-12 周一 13:25]
- State "DONE"       from "TODO"       [2021-04-11 周日 19:31]
- State "DONE"       from "TODO"       [2021-04-10 周六 19:25]
- State "DONE"       from "TODO"       [2021-04-09 周五 18:27]
- State "DONE"       from "TODO"       [2021-04-08 周四 22:06]
- State "DONE"       from "TODO"       [2021-04-07 Wed 23:33]
- State "DONE"       from "TODO"       [2021-04-06 周二 21:54]
- State "DONE"       from "TODO"       [2021-04-05 Mon 22:21]
- State "DONE"       from "TODO"       [2021-04-04 Sun 10:09]
- State "DONE"       from "TODO"       [2021-04-04 Sun 10:09]
- State "DONE"       from "TODO"       [2021-04-03 周六 19:44]
- State "DONE"       from "TODO"       [2021-04-03 Sat 00:50]
- State "DONE"       from "TODO"       [2021-04-02 Fri 00:52]
- State "DONE"       from "TODO"       [2021-03-31 Wed 23:57]
- State "DONE"       from "TODO"       [2021-03-30 Tue 23:41]
- State "DONE"       from "TODO"       [2021-03-30 周二 09:49]
** TODO [#A] 学习《游戏编程模式》                            :learn:ATTACH:
SCHEDULED: <2021-06-01 周二 09:00 ++1d>
:PROPERTIES:
:ID:       b2e6045c-58c3-4359-90d4-74fb2660b8da
:ATTACH: [[attachment:游戏编程模式.org][游戏编程模式笔记]]
:STYLE:    habit
:LAST_REPEAT: [2021-05-31 周一 21:39]
:END:
- State "DONE"       from "TODO"       [2021-05-31 周一 21:39]
- State "DONE"       from "TODO"       [2021-05-28 周五 19:07]
- State "CANCELED"   from "TODO"       [2021-05-22 Sat 12:39] \\
  生病
- State "CANCELED"   from "TODO"       [2021-05-21 周五 16:46] \\
  生病
- State "DONE"       from "TODO"       [2021-05-20 周四 10:09]
- State "CANCELED"   from "TODO"       [2021-05-19 Wed 18:04] \\
  调休不在公司
- State "CANCELED"   from "TODO"       [2021-05-18 周二 23:12] \\
  没时间
- State "DONE"       from "TODO"       [2021-05-17 周一 22:02]
- State "CANCELED"   from "TODO"       [2021-05-16 周日 23:21] \\
  没时间
- State "CANCELED"   from "TODO"       [2021-05-15 周六 21:33] \\
  没时间
- State "CANCELED"   from "TODO"       [2021-05-12 周三 21:21] \\
  没时间
- State "DONE"       from "TODO"       [2021-05-10 周一 11:09]
* Appointment
* Project
** SCH [#A] 单人多队战斗                                           :work:m8:
SCHEDULED: <2021-05-31 周一 13:00> DEADLINE: <2021-06-05 周六 21:00>
:PROPERTIES:
:BLOCKER: children
:END:                          
*** TODO 阅读设计文档并绘制需要的界面 [3/4]
:PROPERTIES:                          
:TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
:END:                          
- [X] 阅读设计文档
- [X] 小队配置界面
- [ ] 队伍卡界面
- [X] 战斗中指示界面
*** WAIT 实现导表
*** WAIT 设计模型层 [0%]
- [ ] 设计模型层
- [ ] 绘制uml
*** WAIT 实现模型层
*** WAIT 实现界面层, 连接战斗界面
*** WAIT 测试
:PROPERTIES:                          
:TRIGGER+: parent todo!(DONE)
:END:
** WAIT [#A] M8项目战斗逻辑模块梳理                               :m8:work:
** Archive                                                        :ARCHIVE:
*** DONE [#A] 制作临时组队功能                                    :work:m8:
CLOSED: [2021-05-28 周五 15:54] SCHEDULED: <2021-05-25 周二 09:00> DEADLINE: <2021-05-29 周六 21:00>
:PROPERTIES:
:BLOCKER: children
:ARCHIVE_TIME: 2021-05-29 周六 17:08
:END:                          
- State "DONE"       from "SCH"        [2021-05-28 周五 15:54]
**** DONE 阅读设计文档并绘制初版界面
CLOSED: [2021-05-26 周三 15:24] SCHEDULED: <2021-05-25 周二 13:13>
:PROPERTIES:                          
:TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
:END:                          
- State "DONE"       from "TODO"       [2021-05-26 周三 15:24]
:LOGBOOK:
CLOCK: [2021-05-25 周二 15:47]--[2021-05-25 周二 16:12] =>  0:25
CLOCK: [2021-05-25 周二 15:17]--[2021-05-25 周二 15:42] =>  0:25
CLOCK: [2021-05-25 周二 14:42]--[2021-05-25 周二 15:07] =>  0:25
CLOCK: [2021-05-25 周二 14:12]--[2021-05-25 周二 14:37] =>  0:25
CLOCK: [2021-05-25 周二 13:42]--[2021-05-25 周二 14:07] =>  0:25
CLOCK: [2021-05-25 周二 13:12]--[2021-05-25 周二 13:37] =>  0:25
:END:
**** DONE 设计模型层 
CLOSED: [2021-05-26 周三 23:20] SCHEDULED: <2021-05-26 周三 15:24>
:PROPERTIES:
:TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
:END:
- State "DONE"       from "TODO"       [2021-05-26 周三 23:20]
**** DONE 实现模型层
CLOSED: [2021-05-27 周四 09:51] SCHEDULED: <2021-05-26 周三 23:20>
:PROPERTIES:
:TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
:END:

- State "DONE"       from "TODO"       [2021-05-27 周四 09:51]
**** DONE 完成网络协议和交互
CLOSED: [2021-05-27 周四 13:46] SCHEDULED: <2021-05-27 周四 09:51>
:PROPERTIES:
:TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
:END:
- State "DONE"       from "TODO"       [2021-05-27 周四 13:46]
**** DONE 实现界面层
CLOSED: [2021-05-27 周四 21:32] SCHEDULED: <2021-05-27 周四 13:46>
:PROPERTIES:
:TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
:END:
- State "DONE"       from "TODO"       [2021-05-27 周四 21:32]
**** DONE 测试
CLOSED: [2021-05-28 周五 15:54] SCHEDULED: <2021-05-27 周四 21:32>
:PROPERTIES:                          
:TRIGGER+: parent todo!(DONE)
:TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
:END:
>>>>>>> 20c01406f2670741a6120775b4c578240da7b3c5
* Someday
** 学习《Unity3D 游戏开发》                                  :learn:future:
** 学习《Lua程序设计》                                       :learn:future:
** 学习《重构 改善既有代码的设计》                            :learn:future:
** 学习 elisp                                                 :learn:future:
** 温习《流畅的python》                                      :learn:future:
** 练习字帖                                                  :learn:future:
** 学习英语                                                  :learn:future:
